[Killed] ConditionalExpression
src/utils/calcDiscount.ts:2:7
 export function calcDiscount(price: number, isVIP: boolean): number {
-  if (isVIP && price > 100) {
+  if (true) {
     return price * 0.8; // 20% discount
   }
killedBy: calcDiscount returns price if not VIP or price <= 100
statusReason: expected 64 to be 80 // Object.is equality

[Killed] EqualityOperator
src/utils/calcDiscount.ts:2:16
 export function calcDiscount(price: number, isVIP: boolean): number {
-  if (isVIP && price > 100) {
+  if (isVIP && price >= 100) {
     return price * 0.8; // 20% discount
   }
killedBy: calcDiscount returns price if not VIP or price <= 100
statusReason: expected 80 to be 100 // Object.is equality

[Killed] ArithmeticOperator
src/utils/calcDiscount.ts:3:12
 export function calcDiscount(price: number, isVIP: boolean): number {
   if (isVIP && price > 100) {
-    return price * 0.8; // 20% discount
+    return price / 0.8; // 20% discount
   }
   return price;
killedBy: calcDiscount applies discount if VIP and price > 100
statusReason: expected 250 to be 160 // Object.is equality
