[Killed] ConditionalExpression
src/components/UserList.tsx:6:7
 export function UserList() {
   const { loading, users } = useUserData();
 
-  if (loading) return <div data-testid="loading">Loading...</div>;
+  if (false) return <div data-testid="loading">Loading...</div>;
   if (!users || users.length === 0) {
     return <div data-testid="no-users">No Users Found</div>;
killedBy: UserList Component displays loading initially
statusReason: Unable to find an element by: [data-testid="loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="no-users"
    >

[Killed] ConditionalExpression
src/components/UserList.tsx:7:17
   const { loading, users } = useUserData();
 
   if (loading) return <div data-testid="loading">Loading...</div>;
-  if (!users || users.length === 0) {
+  if (!users || false) {
     return <div data-testid="no-users">No Users Found</div>;
   }
killedBy: UserList Component displays "No Users Found" if users array is empty
statusReason: Unable to find an element by: [data-testid="no-users"]

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      data-testid="user-list"
    />

[Killed] EqualityOperator
src/components/UserList.tsx:7:17
   const { loading, users } = useUserData();
 
   if (loading) return <div data-testid="loading">Loading...</div>;
-  if (!users || users.length === 0) {
+  if (!users || users.length !== 0) {
     return <div data-testid="no-users">No Users Found</div>;
   }
killedBy: UserList Component displays users after fetch
statusReason: Unable to find an element by: [data-testid="user-list"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="no-users"
    >

[Killed] ArrowFunction
src/components/UserList.tsx:13:18
 
   return (
     <ul data-testid="user-list">
-      {users.map((u) => (
-        <li key={u.id}>{u.name}</li>
-      ))}
+      {users.map(() => undefined)}
     </ul>
   );
killedBy: UserList Component displays users after fetch
statusReason: Unable to find an element with the text: Alice. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <ul
      data-testid="user-list"
    />
