[Killed] BooleanLiteral
src/components/Greeting.tsx:6:52
   isVIP?: boolean;
 }
 
-export function Greeting({ name = "Guest", isVIP = false }: Props) {
+export function Greeting({ name = "Guest", isVIP = true }: Props) {
   if (isVIP) {
     return <h1 data-testid="greeting">Welcome, VIP {name}!</h1>;
killedBy: Greeting Component renders default greeting
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello, Guest!
Received:
  Welcome, VIP Guest!

[Killed] BlockStatement
src/components/Greeting.tsx:7:14
 }
 
 export function Greeting({ name = "Guest", isVIP = false }: Props) {
-  if (isVIP) {
-    return <h1 data-testid="greeting">Welcome, VIP {name}!</h1>;
-  }
+  if (isVIP) {}
   return <h1 data-testid="greeting">Hello, {name}!</h1>;
 }
killedBy: Greeting Component renders VIP greeting
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Welcome, VIP Lisa!
Received:
  Hello, Lisa!

[Killed] ConditionalExpression
src/components/Greeting.tsx:7:7
 }
 
 export function Greeting({ name = "Guest", isVIP = false }: Props) {
-  if (isVIP) {
+  if (true) {
     return <h1 data-testid="greeting">Welcome, VIP {name}!</h1>;
   }
killedBy: Greeting Component renders default greeting
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello, Guest!
Received:
  Welcome, VIP Guest!
