[Killed] BooleanLiteral
src/hooks/useUserData.ts:8:42
   const [users, setUsers] = useState<{ id: number; name: string }[] | null>(
     null
   );
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
 
   useEffect(() => {
killedBy: UserList Component displays loading initially
statusReason: Unable to find an element by: [data-testid="loading"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="no-users"
    >

[Killed] BlockStatement
src/hooks/useUserData.ts:10:19
   );
   const [loading, setLoading] = useState(true);
 
-  useEffect(() => {
-    fetchUsers().then((data) => {
-      setUsers(data);
-      setLoading(false);
-    });
-  }, []);
+  useEffect(() => {}, []);
 
   return { loading, users };
killedBy: UserList Component displays users after fetch
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="loading"
>
  Loading...
</div> instead

[Killed] BlockStatement
src/hooks/useUserData.ts:11:33
   const [loading, setLoading] = useState(true);
 
   useEffect(() => {
-    fetchUsers().then((data) => {
-      setUsers(data);
-      setLoading(false);
-    });
+    fetchUsers().then((data) => {});
   }, []);
 
killedBy: UserList Component displays users after fetch
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="loading"
>
  Loading...
</div> instead

[Killed] BooleanLiteral
src/hooks/useUserData.ts:13:18
   useEffect(() => {
     fetchUsers().then((data) => {
       setUsers(data);
-      setLoading(false);
+      setLoading(true);
     });
   }, []);
killedBy: UserList Component displays users after fetch
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  data-testid="loading"
>
  Loading...
</div> instead
